In [1]:
import pandas as pd
import numpy as np

- .replace()

In [2]:
temp = pd.Series([24, -9999, 22, -8888, 18, 26, -9999])

In [4]:
#Допусти у нас есть измерения температур. 
#Очевидны значения, которые не стоит брать в рассчет (прибор не исправен)
temp

0      24
1   -9999
2      22
3   -8888
4      18
5      26
6   -9999
dtype: int64

In [5]:
#Замена конкретного значения
temp.replace([-9999], np.nan)

0      24.0
1       NaN
2      22.0
3   -8888.0
4      18.0
5      26.0
6       NaN
dtype: float64

In [6]:
#Замена нескольних конкретных значений
temp.replace([-9999, -8888], [np.nan, -1])

0    24.0
1     NaN
2    22.0
3    -1.0
4    18.0
5    26.0
6     NaN
dtype: float64

Мы можем делать замену значений и с помощью loc/iloc, но replace удобнее т.к. loc/iloc требуют указания координат того значения, которое надо заменить, а replace это сделает за нас. 

Надо только указать что менять и на какое значение.

In [ ]:
#Напишем ф-ию, которая будет редактировать наши индексы

In [56]:
airport_data = pd.DataFrame({'airline': ['Air China', 'Jet Airways', 'Aeroflot',
                                         'easyJet'], 'planes': [10, 4, 30, 2]})
country = {'Air China': 'China', 'Jet Airways': 'India', 'Aeroflot': 'Russia',
           'easyJet': 'United Kingdom'}

In [57]:
airport_data['Country'] = airport_data['airline'].map(country)

In [58]:
airport_data['RUS'] = airport_data['airline'].map(lambda x: 'RU' if x == 'Aeroflot' else 'not_RU')

In [59]:
airport_data = airport_data.set_index('airline')

In [60]:
airport_data.index

Index(['Air China', 'Jet Airways', 'Aeroflot', 'easyJet'], dtype='object', name='airline')

In [61]:
def rename_index(x):
    return x[:5].upper()

In [62]:
airport_data.index = airport_data.index.map(rename_index)

In [63]:
airport_data.index

Index(['AIR C', 'JET A', 'AEROF', 'EASYJ'], dtype='object', name='airline')

In [64]:
#Напишем лямбда функцию, которая будет редактировать названия наших колонок

In [65]:
airport_data.columns

Index(['planes', 'Country', 'RUS'], dtype='object')

In [66]:
airport_data.columns = airport_data.columns.map(lambda x: x.upper())

In [67]:
airport_data

         PLANES         COUNTRY     RUS
airline
AIR C        10           China  not_RU
JET A         4           India  not_RU
AEROF        30          Russia      RU
EASYJ         2  United Kingdom  not_RU

- .rename()

In [70]:
airport_data = airport_data.rename(index = {'AIR C' : 'EARTH B'})
airport_data

         PLANES         COUNTRY     RUS
airline
EARTH B      10           China  not_RU
JET A         4           India  not_RU
AEROF        30          Russia      RU
EASYJ         2  United Kingdom  not_RU

In [71]:
airport_data = airport_data.rename(columns = {'RUS' : 'SUR'})
airport_data

         PLANES         COUNTRY     SUR
airline
EARTH B      10           China  not_RU
JET A         4           India  not_RU
AEROF        30          Russia      RU
EASYJ         2  United Kingdom  not_RU

In [72]:
airport_data = airport_data.rename({'EARTH B' : 'AIR C'}, axis=0)
airport_data

         PLANES         COUNTRY     SUR
airline
AIR C        10           China  not_RU
JET A         4           India  not_RU
AEROF        30          Russia      RU
EASYJ         2  United Kingdom  not_RU

In [73]:
airport_data = airport_data.rename({'SUR' : 'RUS'}, axis=1)
airport_data

         PLANES         COUNTRY     RUS
airline
AIR C        10           China  not_RU
JET A         4           India  not_RU
AEROF        30          Russia      RU
EASYJ         2  United Kingdom  not_RU

Самособой через rename() мы одновременно можем менять значения столбцов и колонок

In [ ]:
- .cut()

In [74]:
ages = [20,15,46,84,25,34,22,12,45,125,15,22]

Разобьем наши данные на категории

0-18

18-25

25-35

35-45

55-65

65+

In [75]:
bins = [0, 18, 25, 35, 45, 55, 65]

In [77]:
#Наши значения попали в свои интервалы
pd.cut(ages, bins)

[(18.0, 25.0], (0.0, 18.0], (45.0, 55.0], NaN, (18.0, 25.0], ..., (0.0, 18.0], (35.0, 45.0], NaN, (0.0, 18.0], (18.0, 25.0]]
Length: 12
Categories (6, interval[int64, right]): [(0, 18] < (18, 25] < (25, 35] < (35, 45] < (45, 55] < (55, 65]]

In [78]:
pd.cut(ages, bins, right = True)

[(18.0, 25.0], (0.0, 18.0], (45.0, 55.0], NaN, (18.0, 25.0], ..., (0.0, 18.0], (35.0, 45.0], NaN, (0.0, 18.0], (18.0, 25.0]]
Length: 12
Categories (6, interval[int64, right]): [(0, 18] < (18, 25] < (25, 35] < (35, 45] < (45, 55] < (55, 65]]

Иными словами, с помощью функции cut. Мы выполнили переход от непрерывной переменной к категориальной переменной. Такой шаг еще называют дискретизацией.

In [79]:
result = pd.cut(ages, bins)
result

[(18.0, 25.0], (0.0, 18.0], (45.0, 55.0], NaN, (18.0, 25.0], ..., (0.0, 18.0], (35.0, 45.0], NaN, (0.0, 18.0], (18.0, 25.0]]
Length: 12
Categories (6, interval[int64, right]): [(0, 18] < (18, 25] < (25, 35] < (35, 45] < (45, 55] < (55, 65]]

In [81]:
result.categories

IntervalIndex([(0, 18], (18, 25], (25, 35], (35, 45], (45, 55], (55, 65]], dtype='interval[int64, right]')

In [83]:
result.codes

array([ 1,  0,  4, -1,  1,  2,  1,  0,  3, -1,  0,  1], dtype=int8)

In [84]:
#Посчитаем количество данных в каждой категории
result.value_counts()

(0, 18]     3
(18, 25]    4
(25, 35]    1
(35, 45]    1
(45, 55]    1
(55, 65]    0
dtype: int64

In [86]:
#Зададим лэйблы
groups = ['1', '2', '3', '4', '5', '6']

In [87]:
result = pd.cut(ages, bins, labels = groups)

In [88]:
result

['2', '1', '5', NaN, '2', ..., '1', '4', NaN, '1', '2']
Length: 12
Categories (6, object): ['1' < '2' < '3' < '4' < '5' < '6']

In [90]:
#Пересчитаем результат
result.value_counts()

1    3
2    4
3    1
4    1
5    1
6    0
dtype: int64

- Разобьем данные на количество групп

In [93]:
car_gas = [200, 220, 205, 207, 201, 230, 307, 310, 601, 405, 401, 302]

In [99]:
Car_class = pd.cut(car_gas, 4, labels = ['Первый_класс', 'Второй_класс', 'Третий_класс', 'Четвертый_класс'])

In [100]:
Car_class.value_counts()

Первый_класс       6
Второй_класс       3
Третий_класс       2
Четвертый_класс    1
dtype: int64

- Разобьем данные на равные группы. Так называемая разбивка на квартили

In [102]:
Car_class2 = pd.qcut(car_gas, 4, labels = ['Первый_класс', 'Второй_класс', 'Третий_класс', 'Четвертый_класс'])

In [104]:
Car_class2.value_counts()

Первый_класс       3
Второй_класс       3
Третий_класс       3
Четвертый_класс    3
dtype: int64

# Практика